{
  "qualia": {
    "query": "qualia",
    "results": [
      {
        "title": "Qualia In philosophy of mind, qualia are defined a",
        "snippet": "Qualia In philosophy of mind, qualia are defined as instances of subjective, conscious experience.",
        "url": "https://duckduckgo.com/Qualia"
      },
      {
        "title": "Qualia the Purple A yuri science fiction light nov",
        "snippet": "Qualia the Purple A yuri science fiction light novel written by Hisamitsu Ueo and illustrated by Shirou Tsunashima.",
        "url": "https://duckduckgo.com/Qualia_the_Purple"
      },
      {
        "title": "Qualia (Sony) A boutique brand of high-end electro",
        "snippet": "Qualia (Sony) A boutique brand of high-end electronics, created by Sony to showcase their best technology.",
        "url": "https://duckduckgo.com/Qualia_(Sony)"
      },
      {
        "title": "Qualia (album) The second major studio album by th",
        "snippet": "Qualia (album) The second major studio album by the indie rock band Jinn. It was released on February 6, 2008.",
        "url": "https://duckduckgo.com/Qualia_(album)"
      }
    ],
    "timestamp": 1761008825.013832,
    "source": "duckduckgo"
  },
  "autopoiesis": {
    "query": "autopoiesis",
    "results": [
      {
        "title": "Autopoiesis",
        "snippet": "The term autopoiesis, one of several current theories of life, refers to a system capable of producing and maintaining itself by creating its own parts. The term was introduced in the 1972 publication Autopoiesis and Cognition: The Realization of the Living by Chilean biologists Humberto Maturana and Francisco Varela to define the self-maintaining chemistry of living cells. The concept has since been applied to the fields of cognition, neurobiology, systems theory, architecture and sociology. Niklas Luhmann briefly introduced the concept of autopoiesis to organizational theory.",
        "url": "https://en.wikipedia.org/wiki/Autopoiesis"
      },
      {
        "title": "Self-replication",
        "snippet": "Self-replication",
        "url": "https://duckduckgo.com/c/Self-replication"
      },
      {
        "title": "Enactive cognition",
        "snippet": "Enactive cognition",
        "url": "https://duckduckgo.com/c/Enactive_cognition"
      },
      {
        "title": "Non-equilibrium thermodynamics",
        "snippet": "Non-equilibrium thermodynamics",
        "url": "https://duckduckgo.com/c/Non-equilibrium_thermodynamics"
      },
      {
        "title": "Biological hypotheses",
        "snippet": "Biological hypotheses",
        "url": "https://duckduckgo.com/c/Biological_hypotheses"
      }
    ],
    "timestamp": 1761008825.463001,
    "source": "duckduckgo"
  },
  "emergence": {
    "query": "emergence",
    "results": [
      {
        "title": "Emergence In philosophy, systems theory, science, ",
        "snippet": "Emergence In philosophy, systems theory, science, and art, emergence occurs when a complex entity has...",
        "url": "https://duckduckgo.com/Emergence"
      },
      {
        "title": "Emergentism The philosophical theory that higher-l",
        "snippet": "Emergentism The philosophical theory that higher-level properties or phenomena emerge from more basic...",
        "url": "https://duckduckgo.com/Emergentism"
      },
      {
        "title": "Emergence (TV series) An American mystery-themed t",
        "snippet": "Emergence (TV series) An American mystery-themed thriller television series created by Tara Butters and Michele Fazekas...",
        "url": "https://duckduckgo.com/Emergence_(TV_series)"
      }
    ],
    "timestamp": 1761008825.702256,
    "source": "duckduckgo"
  },
  "quantum entanglement": {
    "query": "quantum entanglement",
    "results": [
      {
        "title": "Quantum entanglement",
        "snippet": "Quantum entanglement is the phenomenon where the quantum state of each particle in a group cannot be described independently of the state of the others, even when the particles are separated by a large distance. The topic of quantum entanglement is at the heart of the disparity between classical physics and quantum physics: entanglement is a primary feature of quantum mechanics not present in classical mechanics. Measurements of physical properties such as position, momentum, spin, and polarization performed on entangled particles can, in some cases, be found to be perfectly correlated. For example, if a pair of entangled particles is generated such that their total spin is known to be zero, and one particle is found to have clockwise spin on a first axis, then the spin of the other particle, measured on the same axis, is found to be anticlockwise.",
        "url": "https://en.wikipedia.org/wiki/Quantum_entanglement"
      },
      {
        "title": "Concurrence - In quantum information science, the ",
        "snippet": "Concurrence - In quantum information science, the concurrence is a state invariant involving qubits.",
        "url": "https://duckduckgo.com/Concurrence_(quantum_computing)"
      },
      {
        "title": "CNOT gate - In computer science, the controlled NO",
        "snippet": "CNOT gate - In computer science, the controlled NOT gate is a quantum logic gate that is an essential component in the construction of a gate-based quantum computer. It can be used to entangle and disentangle Bell states.",
        "url": "https://duckduckgo.com/Controlled_NOT_gate"
      },
      {
        "title": "Einstein's thought experiments - A hallmark of Alb",
        "snippet": "Einstein's thought experiments - A hallmark of Albert Einstein's career was his use of visualized thought experiments as a fundamental tool for understanding physical issues and for elucidating his concepts to others. Einstein's thought experiments took diverse forms. In his youth, he mentally chased beams of light.",
        "url": "https://duckduckgo.com/Einstein's_thought_experiments"
      },
      {
        "title": "Entanglement witness - In quantum information theo",
        "snippet": "Entanglement witness - In quantum information theory, an entanglement witness is a functional which distinguishes a specific entangled state from separable ones. Entanglement witnesses can be linear or nonlinear functionals of the density matrix.",
        "url": "https://duckduckgo.com/Entanglement_witness"
      }
    ],
    "timestamp": 1761008825.953243,
    "source": "duckduckgo"
  }
}